spec/support/vcr_cassettes/mpi/find_candidate/invalid.yml

---
http_interactions:
- request:
    method: post
    uri: "<MVI_URL>"
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <env:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
          <env:Header/>
          <env:Body>
            <idm:PRPA_IN201305UV02 xmlns:idm="http://vaww.oed.oit.va.gov" xmlns:xsi="http://www.w3.org/2001/XMLSchema‐instance" xsi:schemaLocation="urn:hl7‐org:v3 ../../schema/HL7V3/NE2008/multicacheschemas/PRPA_IN201305UV02.xsd" xmlns="urn:hl7‐org:v3" ITSVersion="XML_1.0">
              <id root="1.2.840.114350.1.13.0.1.7.1.1" extension="200VGOV-2c3c0c78-5e44-4ad2-b542-11388c3e45cd"/>
              <creationTime value="20161027055921"/>
              <versionCode code="4.1"/>
              <interactionId root="2.16.840.1.113883.1.6" extension="PRPA_IN201305UV02"/>
              <processingCode code="T"/>
              <processingModeCode code="T"/>
              <acceptAckCode code="AL"/>
              <receiver typeCode="RCV">
                <device classCode="DEV" determinerCode="INSTANCE">
                  <id root="1.2.840.114350.1.13.999.234" extension="200M"/>
                </device>
              </receiver>
              <controlActProcess classCode="CACT" moodCode="EVN">
                <code code="PRPA_TE201305UV02" codeSystem="2.16.840.1.113883.1.6"/>
                <dataEnterer typeCode="ENT" contextControlCode="AP">
                  <assignedPerson classCode="ASSIGNED">
                    <id extension="796122306" root="2.16.840.1.113883.777.999"/>
                    <assignedPerson classCode="PSN" determinerCode="INSTANCE">
                      <name>
                        <given>Mitchell</given>
                        <given>G</given>
                        <family>Jenkins</family>
                      </name>
                    </assignedPerson>
                  </assignedPerson>
                </dataEnterer>
                <queryByParameter>
                  <queryId root="1.2.840.114350.1.13.28.1.18.5.999" extension="18204"/>
                  <statusCode code="new"/>
                  <modifyCode code="MVI.COMP1"/>
                  <initialQuantity value="1"/>
                  <parameterList>
                    <livingSubjectAdministrativeGender>
                      <value code="M"/>
                      <semanticsText>Gender</semanticsText>
                    </livingSubjectAdministrativeGender>
                    <livingSubjectBirthTime>
                      <value value="19490304"/>
                      <semanticsText>Date of Birth</semanticsText>
                    </livingSubjectBirthTime>
                    <livingSubjectId>
                      <value root="2.16.840.1.113883.4.1" extension="796122306"/>
                      <semanticsText>SSN</semanticsText>
                    </livingSubjectId>
                    <livingSubjectName>
                      <value use="L">
                        <given>Mitchell</given>
                        <given>G</given>
                        <family>Jenkins</family>
                      </value>
                      <semanticsText>Legal Name</semanticsText>
                    </livingSubjectName>
                  </parameterList>
                </queryByParameter>
              </controlActProcess>
            </idm:PRPA_IN201305UV02>
          </env:Body>
        </env:Envelope>
    headers:
      Accept:
      - text/xml;charset=UTF-8
      Content-Type:
      - text/xml;charset=UTF-8
      User-Agent:
      - Vets.gov Agent
      Soapaction:
      - PRPA_IN201305UV02
      Date:
      - Thu, 05 Sep 2019 16:45:39 GMT
      Content-Length:
      - '2971'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      X-Backside-Transport:
      - OK OK,OK OK
      Connection:
      - Keep-Alive
      Transfer-Encoding:
      - chunked
      Date:
      - Thu, 05 Sep 2019 16:45:40 GMT
      Content-Type:
      - text/xml
      Set-Cookie:
      - JSESSIONID=Oh4CUTgyIkwchr8odt5zlPGPAFHkineaDCClNPsj6KEE89DhLOyP!-985201547;
        path=/; HttpOnly
      X-Global-Transaction-Id:
      - 4bae058f5d713bb4016e2a43
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?>
        <env:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><env:Header/><env:Body><idm:PRPA_IN201306UV02 ITSVersion="XML_1.0" xsi:schemaLocation="urn:hl7-org:v3 ../../schema/HL7V3/NE2008/multicacheschemas/PRPA_IN201306UV02.xsd" xmlns:idm="http://vaww.oed.oit.va.gov" xmlns="urn:hl7-org:v3"><id extension="WSDOC1909051245402750982473010" root="2.16.840.1.113883.4.349"/><creationTime value="20190905124540"/><versionCode code="4.1"/><interactionId extension="PRPA_IN201306UV02" root="2.16.840.1.113883.1.6"/><processingCode code="T"/><processingModeCode code="T"/><acceptAckCode code="NE"/><receiver typeCode="RCV"><device determinerCode="INSTANCE" classCode="DEV"><id root="null"/></device></receiver><sender typeCode="SND"><device determinerCode="INSTANCE" classCode="DEV"><id extension="200M" root="2.16.840.1.113883.4.349"/></device></sender><acknowledgement><typeCode code="AE"/><targetMessage><id extension="200VGOV-2c3c0c78-5e44-4ad2-b542-11388c3e45cd" root="1.2.840.114350.1.13.0.1.7.1.1"/></targetMessage><acknowledgementDetail><code codeSystem="2.16.840.1.113883.5.1100" code="INTERR" displayName="Internal System Error"/><text>MVI[S]:INVALID REQUEST</text></acknowledgementDetail><acknowledgementDetail><text>MVI[S]:INVALID REQUEST</text></acknowledgementDetail></acknowledgement><controlActProcess classCode="CACT" moodCode="EVN"><code codeSystem="2.16.840.1.113883.1.6" code="PRPA_TE201306UV02"/><queryAck><queryId extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/><queryResponseCode code="AE"/><resultCurrentQuantity value="0"/></queryAck><queryByParameter><queryId extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/><statusCode code="new"/><modifyCode code="MVI.COMP1"/><initialQuantity value="1"/><parameterList><livingSubjectAdministrativeGender><value code="M"/><semanticsText>Gender</semanticsText></livingSubjectAdministrativeGender><livingSubjectBirthTime><value value="19490304"/><semanticsText>Date of Birth</semanticsText></livingSubjectBirthTime><livingSubjectId><value extension="796122306" root="2.16.840.1.113883.4.1"/><semanticsText>SSN</semanticsText></livingSubjectId><livingSubjectName><value use="L"><given>Mitchell</given><given>G</given><family>Jenkins</family></value><semanticsText>Legal Name</semanticsText></livingSubjectName></parameterList></queryByParameter></controlActProcess></idm:PRPA_IN201306UV02></env:Body></env:Envelope>
    http_version: 
  recorded_at: Thu, 05 Sep 2019 16:45:40 GMT
recorded_with: VCR 3.0.3
